================================================================================
procedure
================================================================================
/mmx {2.8346 mul} bind def
--------------------------------------------------------------------------------
(document
  (literal)
  (procedure
    (numeric)
    (operator))
  (operator)
  (operator))

================================================================================
empty array
================================================================================
[]
--------------------------------------------------------------------------------
(document
  (array))

================================================================================
array with one element
================================================================================
[42]
--------------------------------------------------------------------------------
(document
  (array
    (numeric)))

================================================================================
array with two elements
================================================================================
[ 42 42 ]
--------------------------------------------------------------------------------
(document
  (array
    (numeric)
    (numeric)))

================================================================================
empty dict
================================================================================
<<>>
--------------------------------------------------------------------------------
(document
  (dictionary))

================================================================================
dict with one key
================================================================================
<</foobar 42>>
--------------------------------------------------------------------------------
(document
  (dictionary
    (literal)
    (numeric)))

================================================================================
dict with two keys
================================================================================
<< /foo 42/bar 42 >>
--------------------------------------------------------------------------------
(document
  (dictionary
    (literal)
    (numeric)
    (literal)
    (numeric)))
